; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star0 - direction
	Star6 - direction
	Star12 - direction
	Star13 - direction
	Star4 - direction
	Star5 - direction
	GroundStation8 - direction
	Star2 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation10 - direction
	Star1 - direction
	Star9 - direction
	GroundStation7 - direction
	GroundStation14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star9)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite2 Star2)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared0)
	(have_image Star18 infrared0)
))

)

; plan
1. (turn_to satellite0 star4 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon17 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon17 instrument0 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon15 instrument0 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 2 of 5
8. (turn_to satellite0 planet16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet16)
   goals met: 2 of 5
9. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 3 of 5
10. (turn_to satellite0 star18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star18)
   goals met: 3 of 5
11. (take_image satellite0 star18 instrument0 infrared0)
   added: (have_image star18 infrared0)
   goals met: 4 of 5
12. (turn_to satellite2 star2 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star2)
   goals met: 5 of 5
